SAR-mango/SinESC/Old/Dev/Original ST Software/STSW-ESC001V1/ESC_STM32_FOC_FW/Web/SystemDriveParams/Parameters conversion_F2xx.h
/**
  ******************************************************************************
  * @file    Parameters conversion_F2XX.h
  * @author  STMicroelectronics - System Lab - MC Team
  * @version 4.3.0
  * @date    22-Sep-2016 15:29
  * @brief   This file implements the Parameter conversion on the base
  *          of stdlib F2xx for the first drive
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2016 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */
  
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __PARAMETERS_CONVERSION_F2XX_H
#define __PARAMETERS_CONVERSION_F2XX_H

#include "Definitions.h"
#include "PMSM motor parameters.h"
#include "Power stage parameters.h"
#include "Control stage parameters.h"
#include "Drive parameters.h"
#include "stm32f2xx.h"
#include "MC_Math.h"

#define SQRT_2  1.4142
#define SQRT_3  1.732

/************************* CPU & ADC PERIPHERAL CLOCK CONFIG ******************/

#ifdef CPU_CLK_120_MHZ
#define ADC_CLOCK_DIVIDER  ADC_Prescaler_Div2
#define TIM_CLOCK_DIVIDER  2
#define ADV_TIM_CLK_MHz    120uL/TIM_CLOCK_DIVIDER
#define ADC_CLK_MHz        30uL // 30MHz
#define HALL_TIM_CLK       60000000uL
#else
  #warning "CPU_CLK different from 120MHz to be implemented"
#endif

#if defined(EXT_CLK_8_MHZ)
  #error "The HSE frequency set in Contol stage parameters is not automatically configured in system_stm32f2xx.c. Please configure it manually if you require to work with the selected CPU frequency. Once done, comment this line to avoid to show this messagge again."
#elif defined(EXT_CLK_25_MHZ)
  #define HSE_VALUE            ((uint32_t)25000000) /*!< Value of the External oscillator in Hz */
#else
  #warning "Only 8Mhz and 25Mhz ext. frequency is supported!"
#endif

#define ADC1_2  ADC1
/************************* CONTROL FREQUENCIES & DELAIES **********************/
#define TF_REGULATION_RATE 	(uint16_t) ((uint16_t)(PWM_FREQUENCY)/REGULATION_EXECUTION_RATE)
#define REP_COUNTER 			(uint16_t) ((REGULATION_EXECUTION_RATE *2u)-1u)

#define MEDIUM_FREQUENCY_TASK_RATE	(uint16_t)SPEED_LOOP_FREQUENCY_HZ

#define INRUSH_CURRLIMIT_DELAY_COUNTS  (uint16_t)(INRUSH_CURRLIMIT_DELAY_MS * \
                                  ((uint16_t)SPEED_LOOP_FREQUENCY_HZ)/1000u -1u)

#define SYS_TICK_FREQUENCY          2000
#define UI_TASK_FREQUENCY_HZ        10
#define SERIAL_COM_TIMEOUT_INVERSE  25
#define SERIAL_COM_ATR_TIME_MS 20

#define MF_TASK_OCCURENCE_TICKS  (SYS_TICK_FREQUENCY/SPEED_LOOP_FREQUENCY_HZ)-1u
#define UI_TASK_OCCURENCE_TICKS  (SYS_TICK_FREQUENCY/UI_TASK_FREQUENCY_HZ)-1u
#define SERIALCOM_TIMEOUT_OCCURENCE_TICKS (SYS_TICK_FREQUENCY/SERIAL_COM_TIMEOUT_INVERSE)-1u
#define SERIALCOM_ATR_TIME_TICKS (uint16_t)(((SYS_TICK_FREQUENCY * SERIAL_COM_ATR_TIME_MS) / 1000u) - 1u)

/*********************** SENSORLESS REV-UP PARAMETERS *************************/
#define FIRST_SLESS_ALGO_PHASE (ENABLE_SL_ALGO_FROM_PHASE-1u)  

#if OPEN_LOOP_FOC == ENABLE

#define OPEN_LOOP
#undef DEFAULT_TARGET_SPEED_RPM
#define DEFAULT_TARGET_SPEED_RPM       OPEN_LOOP_SPEED_RPM

#undef PHASE1_DURATION
#undef PHASE2_DURATION
#undef PHASE3_DURATION
#undef PHASE4_DURATION
#undef PHASE5_DURATION

#undef PHASE1_FINAL_SPEED_RPM
#undef PHASE2_FINAL_SPEED_RPM
#undef PHASE3_FINAL_SPEED_RPM
#undef PHASE4_FINAL_SPEED_RPM
#undef PHASE5_FINAL_SPEED_RPM

#undef VARIANCE_THRESHOLD
#undef CORD_VARIANCE_THRESHOLD

/* Phase 1 */
#define PHASE1_DURATION		        OPEN_LOOP_SPEED_RAMP_DURATION_MS
#define PHASE1_FINAL_SPEED_RPM	    OPEN_LOOP_SPEED_RPM

/* Phase 2 */
#define PHASE2_DURATION		      65535   /*milliseconds */
#define PHASE2_FINAL_SPEED_RPM	  PHASE1_FINAL_SPEED_RPM

/* Phase 3 */
#define PHASE3_DURATION		       65535   /*milliseconds */
#define PHASE3_FINAL_SPEED_RPM	  PHASE1_FINAL_SPEED_RPM

/* Phase 4 */
#define PHASE4_DURATION		  65535   /*milliseconds */
#define PHASE4_FINAL_SPEED_RPM	  PHASE1_FINAL_SPEED_RPM

/* Phase 5 */
#define PHASE5_DURATION		  65535    /* milliseconds */
#define PHASE5_FINAL_SPEED_RPM	  PHASE1_FINAL_SPEED_RPM

#define VARIANCE_THRESHOLD 0
#define CORD_VARIANCE_THRESHOLD 0

#endif

/* Legacy for WB 4.0 Beta */
#if !defined(OPEN_LOOP_VF)
#define OPEN_LOOP_VF FALSE
#endif
#if !defined(OPEN_LOOP_OFF)
#define OPEN_LOOP_OFF 4400
#endif
#if !defined(OPEN_LOOP_K)
#define OPEN_LOOP_K 44
#endif

/************************* OBSERVER + PLL PARAMETERS **************************/
#define MAX_BEMF_VOLTAGE  (u16)((MAX_APPLICATION_SPEED * 1.2 *\
                           MOTOR_VOLTAGE_CONSTANT*SQRT_2)/(1000u*SQRT_3))

#if (BUS_VOLTAGE_READING == ENABLE)
/*max phase voltage, 0-peak Volts*/
#define MAX_VOLTAGE (int16_t)((MCU_SUPPLY_VOLTAGE/2)/BUS_ADC_CONV_RATIO) 
#else
#define MAX_VOLTAGE (int16_t)(500/2) /* Virtual sensor conversion factor */
#endif

#ifdef ICS_SENSORS 
#define MAX_CURRENT (MCU_SUPPLY_VOLTAGE/(2*AMPLIFICATION_GAIN))
#else
#define MAX_CURRENT (MCU_SUPPLY_VOLTAGE/(2*RSHUNT*AMPLIFICATION_GAIN))
#endif

#define C1 (int32_t)((((int16_t)F1)*RS)/(LS*TF_REGULATION_RATE))
#define C2 (int32_t) GAIN1
#define C3 (int32_t)((((int16_t)F1)*MAX_BEMF_VOLTAGE)/(LS*MAX_CURRENT*TF_REGULATION_RATE))
#define C4 (int32_t) GAIN2
#define C5 (int32_t)((((int16_t)F1)*MAX_VOLTAGE)/(LS*MAX_CURRENT*TF_REGULATION_RATE))

#define PERCENTAGE_FACTOR    (uint16_t)(VARIANCE_THRESHOLD*128u)      
#define OBS_MINIMUM_SPEED        (uint16_t) (OBS_MINIMUM_SPEED_RPM/6u)
#define HFI_MINIMUM_SPEED        (uint16_t) (HFI_MINIMUM_SPEED_RPM/6u)

/*********************** OBSERVER + CORDIC PARAMETERS *************************/
#define CORD_C1 (int32_t)((((int16_t)CORD_F1)*RS)/(LS*TF_REGULATION_RATE))
#define CORD_C2 (int32_t) CORD_GAIN1
#define CORD_C3 (int32_t)((((int16_t)CORD_F1)*MAX_BEMF_VOLTAGE)/(LS*MAX_CURRENT\
                                                           *TF_REGULATION_RATE))
#define CORD_C4 (int32_t) CORD_GAIN2
#define CORD_C5 (int32_t)((((int16_t)CORD_F1)*MAX_VOLTAGE)/(LS*MAX_CURRENT*\
                                                          TF_REGULATION_RATE))
#define CORD_PERCENTAGE_FACTOR    (uint16_t)(CORD_VARIANCE_THRESHOLD*128u)      
#define CORD_MINIMUM_SPEED        (uint16_t) (CORD_MINIMUM_SPEED_RPM/6u)
/**************************   VOLTAGE CONVERSIONS  ****************************/
#define BUS_ADC_CONV_RATIO       VBUS_PARTITIONING_FACTOR

#define OVERVOLTAGE_THRESHOLD_d   (uint16_t)(OV_VOLTAGE_THRESHOLD_V*65535/\
                                  (MCU_SUPPLY_VOLTAGE/VBUS_PARTITIONING_FACTOR))
#define UNDERVOLTAGE_THRESHOLD_d  (uint16_t)((UD_VOLTAGE_THRESHOLD_V*65535)/\
                                  ((uint16_t)(MCU_SUPPLY_VOLTAGE/\
                                                           BUS_ADC_CONV_RATIO)))
#define INT_SUPPLY_VOLTAGE          (uint16_t)(65536/MCU_SUPPLY_VOLTAGE)

#define DELTA_TEMP_THRESHOLD        (OV_TEMPERATURE_THRESHOLD_C- T0_C)
#define DELTA_V_THRESHOLD           (dV_dT * DELTA_TEMP_THRESHOLD)
#define OV_TEMPERATURE_THRESHOLD_d  ((V0_V + DELTA_V_THRESHOLD)*INT_SUPPLY_VOLTAGE)

