SAR-mango/SinESC/Old/Dev/Original ST Software/STSW-ESC001V1/ESC_STM32_FOC_FW/Web/SystemDriveParams/Parameters conversion_F2xx.h
#if (USART_SELECTION == USE_USART4)
  #define USART                   UART4
  #define USART_CLK               RCC_APB1Periph_USART4
  #define USART_IRQ               USART4_IRQn
  #define USART_IRQHandler        USART4_IRQHandler
  /* Dummy */
  #define USART_GPIO_REMAP      GPIO_NoRemap_USARTx
#endif

#if (USART_SELECTION == USE_USART5)
  #define USART                   UART5
  #define USART_CLK               RCC_APB1Periph_USART5
  #define USART_IRQ               USART5_IRQn
  #define USART_IRQHandler        USART5_IRQHandler
  /* Dummy */
  #define USART_GPIO_REMAP      GPIO_NoRemap_USARTx
#endif

#if (USART_SELECTION == USE_USART6)
  #define USART                   USART6
  #define USART_CLK               RCC_APB2Periph_USART6
  #define USART_IRQ               USART6_IRQn
  #define USART_IRQHandler        USART6_IRQHandler
  /* Dummy */
  #define USART_GPIO_REMAP      GPIO_NoRemap_USARTx
#endif

#define NVIC_USART_INIT_STR \
const NVIC_InitTypeDef NVICInitHW_str =\
{\
  USART_IRQ,  /* NVIC_IRQChannel */\
  USART_PRE_EMPTION_PRIORITY,            /* NVIC_IRQChannelPreemptionPriority */\
  USART_SUB_PRIORITY,            /* NVIC_IRQChannelSubPriority */\
  (FunctionalState)(ENABLE)        /* NVIC_IRQChannelCmd */\
};

/****** Prepares the UI configurations according the MCconfxx settings ********/
#ifdef LCD_FUNCTIONALITY
  #define LCD_ENABLE |OPT_LCD
#else
  #define LCD_ENABLE 
#endif

#ifdef SERIAL_COMMUNICATION
  #define COM_ENABLE |OPT_COM
#else
  #define COM_ENABLE
#endif

#ifdef DAC_FUNCTIONALITY
  #define DAC_ENABLE |OPT_DAC
  #define DAC_OP_ENABLE |UI_CFGOPT_DAC
  #define DAC_OPTION OPT_DAC
#else
  #define DAC_ENABLE
  #define DAC_OP_ENABLE
#endif

/* Motor 1 settings */
#ifdef FLUX_WEAKENING
  #define FW_ENABLE |UI_CFGOPT_FW
#else
  #define FW_ENABLE
#endif

#ifdef DIFFERENTIAL_TERM_ENABLED
  #define DIFFTERM_ENABLE |UI_CFGOPT_SPEED_KD|UI_CFGOPT_Iq_KD|UI_CFGOPT_Id_KD
#else
  #define DIFFTERM_ENABLE
#endif

/* Sensors setting */
#ifdef STATE_OBSERVER_PLL
  #define MAIN_SCFG UI_SCODE_STO_PLL
#endif

#ifdef STATE_OBSERVER_CORDIC
  #define MAIN_SCFG UI_SCODE_STO_CR
#endif

#ifdef AUX_STATE_OBSERVER_PLL
  #define AUX_SCFG UI_SCODE_STO_PLL
#endif

#ifdef AUX_STATE_OBSERVER_CORDIC
  #define AUX_SCFG UI_SCODE_STO_CR
#endif

#ifdef ENCODER
  #define MAIN_SCFG UI_SCODE_ENC
#endif

#ifdef VIEW_ENCODER_FEEDBACK
  #define AUX_SCFG UI_SCODE_ENC
#endif

#ifdef HALL_SENSORS
  #define MAIN_SCFG UI_SCODE_HALL
#endif

#ifdef VIEW_HALL_FEEDBACK
  #define AUX_SCFG UI_SCODE_HALL
#endif

#ifndef AUX_SCFG
#define AUX_SCFG 0x0
#endif

#if defined(PLLTUNING)
  #define PLLTUNING_ENABLE |UI_CFGOPT_PLLTUNING
#else
  #define PLLTUNING_ENABLE
#endif

#if defined(PFC_ENABLED)
  #define UI_CFGOPT_PFC_ENABLE |UI_CFGOPT_PFC
#else
  #define UI_CFGOPT_PFC_ENABLE
#endif

/******************************************************************************* 
  * UI configurations settings. It can be manually overwritten if special 
  * configuartion is required. 
*******************************************************************************/

/* Base configuration of UI */
#define UI_INIT_CFG ( OPT_NONE LCD_ENABLE COM_ENABLE DAC_ENABLE )

/* Specific options of UI */
#define UI_CONFIG_M1 ( UI_CFGOPT_NONE DAC_OP_ENABLE FW_ENABLE DIFFTERM_ENABLE \
  | (MAIN_SCFG << MAIN_SCFG_POS) | (AUX_SCFG << AUX_SCFG_POS) | UI_CFGOPT_SETIDINSPDMODE PLLTUNING_ENABLE UI_CFGOPT_PFC_ENABLE | UI_CFGOPT_PLLTUNING)

#ifdef SINGLEDRIVE
  #define UI_CONFIG_M2
#endif

/* Push button definitions */
#define BUTTON_KEY_ACTIVE   Bit_RESET
#define BUTTON_KEY_INACTIVE Bit_SET
#define JOYSTIK_ACTIVE      Bit_RESET
#define JOYSTIK_INACTIVE    Bit_SET

/* Below Function prototype definitions can be removed adding the inclusion of 
Timebase.h in stm32f10x_MC_it.c */
void TB_SerialCommunicationTimeOutStop(void);
void TB_SerialCommunicationTimeOutStart(void);

#endif /*__PARAMETERS_CONVERSION_F2XX_H*/

/******************* (C) COPYRIGHT 2016 STMicroelectronics *****END OF FILE****/
